aqandu/cc3200-firmware/src/main.c
    	if ( lRetVal != ROLE_AP )
    	{
    		// Put the device into AP mode.
    		lRetVal = ConfigureMode(ROLE_AP);
    		ASSERT_ON_ERROR(lRetVal);
    	}

		// Now the device is in AP mode, we need to wait for this event
		// before doing anything
		while(!IS_IP_ACQUIRED(g_ulStatus))
		{
		#ifndef SL_PLATFORM_MULTI_THREADED
		  _SlNonOsMainLoopTask();
		#endif
		}

    	// Stop Internal HTTP Server
		lRetVal = sl_NetAppStop(SL_NET_APP_HTTP_SERVER_ID);
		ASSERT_ON_ERROR( lRetVal);

		// Start Internal HTTP Server
		lRetVal = sl_NetAppStart(SL_NET_APP_HTTP_SERVER_ID);
		ASSERT_ON_ERROR( lRetVal);

	    char ssid[32];
	    unsigned short len = 32;
	    unsigned short config_opt = WLAN_AP_OPT_SSID;
	    sl_WlanGet(SL_WLAN_CFG_AP_ID, &config_opt , &len, (unsigned char* )ssid);
	    UART_PRINT("\n\r Connect to : \'%s\'\n\r\n\r",ssid);
    }
    else
    {
    	if ( lRetVal == ROLE_AP )
    	{
    		UART_PRINT("Device is in AP Mode and Force AP Jumper is not Connected.\n\r");

            // If the device is in AP mode, we need to wait for this event
            // before doing anything
            while(!IS_IP_ACQUIRED(g_ulStatus))
            {
            #ifndef SL_PLATFORM_MULTI_THREADED
              _SlNonOsMainLoopTask();
            #endif
            }
    	}

        // Switch to STA Mode
        lRetVal = ConfigureMode(ROLE_STA);
        ASSERT_ON_ERROR( lRetVal);

        UART_PRINT("Device has been put into STA Mode.\n\r");

        // Stop Internal HTTP Server
		lRetVal = sl_NetAppStop(SL_NET_APP_HTTP_SERVER_ID);
		ASSERT_ON_ERROR( lRetVal);

		// Start Internal HTTP Server
		lRetVal = sl_NetAppStart(SL_NET_APP_HTTP_SERVER_ID);
		ASSERT_ON_ERROR( lRetVal);

		// Waiting for the device to Auto Connect
		UART_PRINT("Trying to Auto Connect to Existing Profiles.\n\r");

		while(uiConnectTimeoutCnt < AUTO_CONNECTION_TIMEOUT_COUNT &&
			((!IS_CONNECTED(g_ulStatus)) || (!IS_IP_ACQUIRED(g_ulStatus))))
		{
			// Turn STAT 1 LED On
			GPIO_IF_LedOn(MCU_STAT_1_LED_GPIO);
			osi_Sleep(50);

			// Turn STAT 1 LED Off
			GPIO_IF_LedOff(MCU_STAT_1_LED_GPIO);
			osi_Sleep(50);

			uiConnectTimeoutCnt++;
		}

		// Couldn't connect Using Auto Profile
		if(uiConnectTimeoutCnt == AUTO_CONNECTION_TIMEOUT_COUNT)
		{
			UART_PRINT("Couldn't connect Using Auto Profile.\n\r");

			// Blink STAT1 LEd to Indicate Connection Error
			GPIO_IF_LedOn(MCU_STAT_1_LED_GPIO);

			CLR_STATUS_BIT_ALL(g_ulStatus);

			// Put the station into AP mode
			lRetVal = ConfigureMode(ROLE_AP);
			ASSERT_ON_ERROR( lRetVal);
			UART_PRINT("Device has been put into AP Mode.\n\r");


			// Waiting for the AP to acquire IP address from Internal DHCP Server
			// If the device is in AP mode, we need to wait for this event
			// before doing anything
			while(!IS_IP_ACQUIRED(g_ulStatus))
			{
			#ifndef SL_PLATFORM_MULTI_THREADED
				_SlNonOsMainLoopTask();
			#endif
			}

			char cCount=0;

			// Blink LED 3 times to Indicate AP Mode
			for(cCount=0; cCount<3; cCount++)
			{
				// Turn STAT1 LED On
				GPIO_IF_LedOn(MCU_STAT_1_LED_GPIO);
				osi_Sleep(400);

				// Turn STAT1 LED Off
				GPIO_IF_LedOff(MCU_STAT_1_LED_GPIO);
				osi_Sleep(400);
			}

		    char ssid[32];
		    unsigned short len = 32;
		    unsigned short config_opt = WLAN_AP_OPT_SSID;
		    sl_WlanGet(SL_WLAN_CFG_AP_ID, &config_opt , &len, (unsigned char* )ssid);
		    UART_PRINT("\n\r Connect to : \'%s\'\n\r\n\r",ssid);
		}

		// Turn STAT1 LED Off
		GPIO_IF_LedOff(MCU_STAT_1_LED_GPIO);

		g_iInternetAccess = ConnectionTest();

    }

    return SUCCESS;
}


//****************************************************************************
//
//!    \brief Read Force AP GPIO and Configure Mode - 1(Access Point Mode)
//!                                                  - 0 (Station Mode)
//!
//! \return                        None
//
//****************************************************************************
static void ReadDeviceConfiguration()
{
    unsigned int uiGPIOPort;
    unsigned char pucGPIOPin;
    unsigned char ucPinValue;
        
    // Read GPIO
    GPIO_IF_GetPortNPin(SH_GPIO_3,&uiGPIOPort,&pucGPIOPin);
    ucPinValue = GPIO_IF_Get(SH_GPIO_3,uiGPIOPort,pucGPIOPin);
        
    // If Connected to VCC, Mode is AP
    if(ucPinValue == 1)
    {
        // AP Mode
        g_uiDeviceModeConfig = ROLE_AP;
    }
    else
    {
        // STA Mode
        g_uiDeviceModeConfig = ROLE_STA;
    }

}

//****************************************************************************
//
//!    \brief OOB Application Main Task - Initializes SimpleLink Driver and
//!                                              Handles HTTP Requests
//! \param[in]                  pvParameters is the data passed to the Task
//!
//! \return                        None
//
//****************************************************************************
static void OOBTask(void *pvParameters)
{
    long   lRetVal = -1;

    // Read Device Mode Configuration
    ReadDeviceConfiguration();

    // Connect to Network
    lRetVal = ConnectToNetwork();
    if(lRetVal < 0)
    {
        ERR_PRINT(lRetVal);
        LOOP_FOREVER();
    }

    // Handle Async Events
    while(1)
    {
        // LED Actions
        if(g_ucLEDStatus == LED_ON)
        {
            GPIO_IF_LedOn(MCU_STAT_1_LED_GPIO);
            osi_Sleep(500);
        }
        if(g_ucLEDStatus == LED_OFF)
        {
            GPIO_IF_LedOff(MCU_STAT_1_LED_GPIO);
            osi_Sleep(500);
        }
        if(g_ucLEDStatus==LED_BLINK)
        {
            GPIO_IF_LedOn(MCU_STAT_1_LED_GPIO);
            osi_Sleep(500);
            GPIO_IF_LedOff(MCU_STAT_1_LED_GPIO);
            osi_Sleep(500);
        }
    }
}

//****************************************************************************
//
//!    \brief DataGather Application Task - Samples the sensors every 1 minute.
//! \param[in]                  pvParameters is the data passed to the Task
//!
//! \return                        None
//
//****************************************************************************
static void DataGatherTask(void *pvParameters)
{
	TickType_t xLastWakeTime;
	const TickType_t xFreq = 3000; // 60 seconds

	xLastWakeTime = xTaskGetTickCount();

	float temperature;
	float humidity;
	float light;
	unsigned int pm01;
	unsigned int pm2_5;
	unsigned int pm10;
	unsigned char pm_buf[24];



	int i = 0;
	while (1)
	{
		vTaskDelayUntil(&xLastWakeTime, xFreq);

		// Gather i2c sensor data
		I2C_IF_Open(I2C_MASTER_MODE_FST);
		temperature = GetTemperature();
		humidity = GetHumidity();
		ConfigureOPT3001Mode();
		light = GetOPT3001Result();

