aqandu/cc3200-firmware/src/main.c
		//TODO CO/NO2
		I2C_IF_Close(I2C_MASTER_MODE_FST);

		InitPMS();


		// Gather uart sensor data
		//TODO GPS
		//TODO PMS
		pm01 = GetPM01(pm_buf);
		pm2_5 = GetPM2_5(pm_buf);
		pm10 = GetPM10(pm_buf);


		// Write data to uSD card
		char *csv = (char*)malloc(50 * sizeof(char));
		sprintf(csv, "%i,%f,%f,%f,%u,%u,%u\r\n", i++, temperature, humidity, light,pm01, pm2_5, pm10);
		//Message("%f,%f,%f", temperature, humidity, light);
		//Message("\n\n\rWriting sensor data to file...\n\r");
		//TODO create file for each new day using GPS
		// this will propose a problem though if date doesnt get set
		f_mount(&fs, "", 0);
		/* Open or create a log file and ready to append */
		res = f_append(&fp, "logfile.txt");
		if (res == FR_OK) {
			/* Append a line */
			res = f_write(&fp,csv,50,&Size);
			//Report("Wrote : %d Bytes",Size);
			/* Close the file */
			res = f_close(&fp);

		}
		else
		{
			//Message("Failed to create a new file\n\r");
		}

	}
}

//****************************************************************************
//
//!    \brief DataUpload Application Task - Uploads collected data every 90 minutes.
//! \param[in]                  pvParameters is the data passed to the Task
//!
//! \return                        None
//
//****************************************************************************
//static void DataUploadTask(void *pvParameters)
//{
//	TickType_t xLastWakeTime;
//	const TickType_t xFreq = 60000; // 1 minute
//
//	xLastWakeTime = xTaskGetTickCount();
//
//	int i = 0;
//	while (1)
//	{
//		vTaskDelayUntil(&xLastWakeTime, xFreq);
//
//		// Write over UART
//		UART_PRINT("%d\r\n", i++);
//	}
//}

//*****************************************************************************
//
//! Application startup display on UART
//!
//! \param  none
//!
//! \return none
//!
//*****************************************************************************
static void DisplayBanner(char * AppName)
{
    UART_PRINT("\n\n\n\r");
    UART_PRINT("\t\t *************************************************\n\r");
    UART_PRINT("\t\t     CC3200 %s Application       \n\r", AppName);
    UART_PRINT("\t\t *************************************************\n\r");
    UART_PRINT("\n\n\n\r");
}

//****************************************************************************
//
//! List the files in the given directory
//!
//! \param pointer to directory
//!
//! \return None.
//
//****************************************************************************
static void
ListDirectory(DIR *dir)
{
    FILINFO fno;
    FRESULT res;
    unsigned long ulSize;
    tBoolean bIsInKB;

    for(;;)
    {
        res = f_readdir(dir, &fno);           // Read a directory item
        if (res != FR_OK || fno.fname[0] == 0)
        {
        break;                                // Break on error or end of dir
        }
        ulSize = fno.fsize;
        bIsInKB = false;
        if(ulSize > 1024)
        {
            ulSize = ulSize/1024;
            bIsInKB = true;
        }
        Report("->%-15s%5d %-2s    %-5s\n\r",fno.fname,ulSize,\
                (bIsInKB == true)?"KB":"B",(fno.fattrib&AM_DIR)?"Dir":"File");
    }

}

//*****************************************************************************
//
//! Board Initialization & Configuration
//!
//! \param  None
//!
//! \return None
//
//*****************************************************************************
static void BoardInit(void)
{

    // Set vector table base
#if defined(ccs) || defined(gcc)
    MAP_IntVTableBaseSet((unsigned long)&g_pfnVectors[0]);
#endif
#if defined(ewarm)
    MAP_IntVTableBaseSet((unsigned long)&__vector_table);
#endif
    
    // Enable Processor
    MAP_IntMasterEnable();
    MAP_IntEnable(FAULT_SYSTICK);

    PRCMCC3200MCUInit();
}

static void SDInit(){
	//
	// Set the SD card clock as output pin
	//
	MAP_PinDirModeSet(PIN_07,PIN_DIR_MODE_OUT);

	//
	// Enable Pull up on data
	//
	MAP_PinConfigSet(PIN_06,PIN_STRENGTH_4MA, PIN_TYPE_STD_PU);

	//
	// Enable Pull up on CMD
	//
	MAP_PinConfigSet(PIN_08,PIN_STRENGTH_4MA, PIN_TYPE_STD_PU);

	//
	// Enable MMCHS
	//
	MAP_PRCMPeripheralClkEnable(PRCM_SDHOST,PRCM_RUN_MODE_CLK);

	//
	// Reset MMCHS
	//
	MAP_PRCMPeripheralReset(PRCM_SDHOST);

	//
	// Configure MMCHS
    //
	MAP_SDHostInit(SDHOST_BASE);

	//
	// Configure card clock
	//
	MAP_SDHostSetExpClk(SDHOST_BASE, MAP_PRCMPeripheralClockGet(PRCM_SDHOST),15000000);


}

void main()
{
    // Board Initialization
    BoardInit();
    
    // Configure the pinmux settings for the peripherals exercised
    PinMuxConfig();

    PinConfigSet(PIN_58,PIN_STRENGTH_2MA|PIN_STRENGTH_4MA,PIN_TYPE_STD_PD);

    // Initialize Global Variables
    InitializeAppVariables();
    
    // UART Init

    //InitTerm();
    
    // uSD Init
    SDInit();


    //DisplayBanner(APP_NAME);

    // LED Init
    GPIO_IF_LedConfigure(STATLED1);
      
    // Turn Off the LEDs
    GPIO_IF_LedOff(MCU_STAT_1_LED_GPIO);

    // Simplelink Spawn Task
    VStartSimpleLinkSpawnTask(SPAWN_TASK_PRIORITY);
    
    // Create OOB Task
//    osi_TaskCreate(OOBTask, (signed char*)"OOBTask", \
//                                OSI_STACK_SIZE, NULL, \
//                                OOB_TASK_PRIORITY, NULL );

    // Create the DataGather Task
    osi_TaskCreate(DataGatherTask, (signed char*)"DataGatherTask",
    		OSI_STACK_SIZE, NULL, DATAGATHER_TASK_PRIORITY, NULL);

//    // Create the DataUpload Task
//    osi_TaskCreate(DataUploadTask, (signed char*)"DataUploadTask",
//        						 OSI_STACK_SIZE, NULL, DATAUPLOAD_TASK_PRIORITY, NULL);

    // Start OS Scheduler
    osi_start();

    while (1)
    {

    }

}
